Documents/бит_Предупреждение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_Предупреждение</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бит_ПредупрежденияЖильцам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинСуммаДолга</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МоментРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектВыбора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЛицевыхСчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПогашения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонИзвещений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ШаблоныИзвещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЛицевыеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтветственноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Сумма с учетом переплат. Фактическая сумма долга. Без пени.</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезПереплат</Name>
							<Comment>Сумма без учета переплат по услугам в разрезе ЛС</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПени</Name>
							<Comment>Сумма начисленной пени</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/бит_ЛицевыеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_ЛицевыеСчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Архивный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕЛСГИСЖКХ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЖКУ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапРемЕЛСГИСЖКХ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапРемИдентификаторЖКУ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапРемПрефикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Квартиры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоГУГЦЖС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВестиРасчетПени</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьПоГруппам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЛицевогоСчетаГИСЖКХ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипЛицевогоСчетаГИСЖКХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УлицаЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Льготный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/бит_Предупреждение/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс
	
// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

Функция ПодготовитьПредупреждения(Ссылка) Экспорт
	
	СоответствиеЛС = Новый Соответствие();
	
	ДанныеДокумента =  ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Дата,Организация,СрокПогашения,ДатаРасчета");
	
	ПараметрыЖКХ = Новый Структура;
	ПараметрыЖКХ.Вставить("ВыводитьСуммуБезУчетаПереплатПоУслугам", Ложь);
	ПараметрыЖКХ.Вставить("ВключатьВРасчетСуммыДолгаПени"         , Ложь);
	бит_ОбщегоНазначения.ПолучитьНастройкиЖКХ(ДанныеДокумента.Дата, ДанныеДокумента.Организация, ПараметрыЖКХ);
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.бит_Предупреждение.Предупреждение");
	
	Руководители = ОтветственныеЛицаБП.ОтветственныеЛица(ДанныеДокумента.Организация, ДанныеДокумента.Дата);
	
	СтруктураПечати = Новый Структура();
	СтруктураПечати.Вставить("Организация"          ,ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеДокумента.Организация, "Наименование"));
	СтруктураПечати.Вставить("ФИОРуководителя"      ,Руководители.Руководитель);
	СтруктураПечати.Вставить("ДолжностьРуководителя",Руководители.РуководительДолжность);
	СтруктураПечати.Вставить("СрокПогашения"        ,Формат(ДанныеДокумента.СрокПогашения, "ДФ='dd MMMM yyyy ""г.""'"));
	
	Если ЗначениеЗаполнено(ДанныеДокумента.ДатаРасчета) Тогда
		ДатаПросмотра = ДанныеДокумента.ДатаРасчета;
	Иначе
		ДатаПросмотра = ДанныеДокумента.Дата;
	КонецЕсли;
	
	СтруктураПечати.Вставить("ДатаПросмотра", Формат(ДатаПросмотра, "ДФ='dd MMMM yyyy ""г.""'"));
	
	ФормСтрока  = "Л = ru_RU; ДП = Истина";
	ПарПредмета = "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_ПредупреждениеЛицевыеСчета.Ссылка КАК Ссылка,
	|	бит_ПредупреждениеЛицевыеСчета.НомерСтроки КАК НомерСтроки,
	|	бит_ПредупреждениеЛицевыеСчета.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_ПредупреждениеЛицевыеСчета.ОтветственноеЛицо КАК ОтветственноеЛицо,
	|	бит_ПредупреждениеЛицевыеСчета.Сумма КАК Сумма,
	|	бит_ПредупреждениеЛицевыеСчета.СуммаБезПереплат КАК СуммаБезПереплат,
	|	бит_ПредупреждениеЛицевыеСчета.СуммаПени КАК СуммаПени,
	|	ЕСТЬNULL(бит_ЛицевыеСчета.Здание, ЗНАЧЕНИЕ(Справочник.бит_СписокЗданий.ПустаяСсылка)) КАК Здание,
	|	ЕСТЬNULL(бит_ЛицевыеСчета.Квартира, """") КАК Квартира
	|ИЗ
	|	Документ.бит_Предупреждение.ЛицевыеСчета КАК бит_ПредупреждениеЛицевыеСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|		ПО бит_ПредупреждениеЛицевыеСчета.ЛицевойСчет = бит_ЛицевыеСчета.Ссылка
	|ГДЕ
	|	бит_ПредупреждениеЛицевыеСчета.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ТабДокумент   = Новый ТабличныйДокумент();
		ТабДокумент.КлючПараметровПечати = "МакетПредупреждения";
		ШапкаОбласть  = Макет.ПолучитьОбласть("ОбластьШапка");
		
		
		СтруктураПечати.Вставить("ФИО",   Выборка.ОтветственноеЛицо);
		СтруктураПечати.Вставить("Адрес", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.Здание, "ПочтовыйАдрес") + ?(ЗначениеЗаполнено(Выборка.Квартира),", кв. " + Строка(Выборка.Квартира),""));
		
		Если НЕ ПараметрыЖКХ.ВыводитьСуммуБезУчетаПереплатПоУслугам Тогда
			Сумма = Выборка.Сумма;
		Иначе
			Сумма = Выборка.СуммаБезПереплат;
		КонецЕсли;
		
		Если ПараметрыЖКХ.ВключатьВРасчетСуммыДолгаПени Тогда
			Сумма = Сумма + Выборка.СуммаПени;
		КонецЕсли;
		
		СуммаПрописью = ЧислоПрописью(Сумма,ФормСтрока, ПарПредмета);
		СтруктураПечати.Вставить("Сумма"        , Сумма);
		СтруктураПечати.Вставить("СуммаПрописью", СуммаПрописью);
		
		ШапкаОбласть  = Макет.ПолучитьОбласть("ОбластьШапка");
		ШапкаОбласть.Параметры.Заполнить(СтруктураПечати);
		
		Для Каждого ТекПараметр Из СтруктураПечати Цикл
			Пока НайтиИЗаменитьВДокументе(ШапкаОбласть, "[" + ТекПараметр.Ключ + "]", ТекПараметр.Значение) Цикл
			КонецЦикла;
		КонецЦикла;
		
		СтрокаПредупреждения = Новый Массив;
		СтрокаПредупреждения.Добавить(ШапкаОбласть);
		
		Если Не ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДокумент, СтрокаПредупреждения) Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ТабДокумент.Вывести(ШапкаОбласть);
		ТабДокумент.ОбластьПечати      = ТабДокумент.Область(1, 2, ТабДокумент.ВысотаТаблицы, ТабДокумент.ШиринаТаблицы);
		ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		ТабДокумент.ПолеСверху         = 0;
		ТабДокумент.ПолеСлева          = 0;
		ТабДокумент.ПолеСнизу          = 0;
		ТабДокумент.ПолеСправа         = 0;
		
		СоответствиеЛС.Вставить(Выборка.ЛицевойСчет, ТабДокумент) 
		
	КонецЦикла;
	
	Возврат СоответствиеЛС;
	
КонецФункции

// Производит замену строк в указанном табличном документе.
//
// Возвращаемое значение:
//  Булево – была ли произведена замена.
//
Функция НайтиИЗаменитьВДокументе(ТабДок, СтрокаПоиска, СтрокаЗамены)
	
	ОбластьЗамены = ТабДок.НайтиТекст(СтрокаПоиска);
	Если ОбластьЗамены = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	ОбластьЗамены.Текст = СтрЗаменить(ОбластьЗамены.Текст, СтрокаПоиска, СтрокаЗамены);
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#КонецЕсли
